tutorials/laminar/fixedSpecificHumidityBC/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    walls 
    {
        type            zeroGradient;
    }

    inletTop
    {
        type            fixedValue;
        value           uniform 305;
    }

    inletBottom
    {
        type            fixedValue;
        value           uniform 300;
    }

    outletTop
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    outletBottom
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
